/**
 * @author : dx
 * @date : 2018/11/20
 * Description :
 */
public class 落单的数 {
    /**
     * 描述
     * 给出2*n + 1 个的数字，除其中一个数字之外其他每个数字均出现两次，找到这个数字。
     *
     *
     *
     * 您在真实的面试中是否遇到过这个题？
     * 样例
     * 给出 [1,2,2,1,3,4,3]，返回 4
     *
     * 挑战
     * 一次遍历，常数级的额外空间复杂度
     *
     * 思路：
     * 位异或( ^ )
     * System.out.println(5 ^ 3);//结果为6
     * 5转换为二进制：0000 0000 0000 0000 0000 0000 0000 0101
     *
     * 3转换为二进制：0000 0000 0000 0000 0000 0000 0000 0011
     *
     * 6转换为二进制：0000 0000 0000 0000 0000 0000 0000 0110
     * ---------------------
     */


    public int singleNumber(int[] A) {
        if(A == null || A.length == 0) {
            return -1;
        }
        int rst = 0;
        for (int i = 0; i < A.length; i++) {
            rst ^= A[i];
        }
        return rst;
    }
}
